installationsWithAdditionalTools/openfoam-5.x_CFDEM/03_testCases/enzu_test/CFD.base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          3e-4;

//writeControl    adjustableRunTime;
writeControl    timeStep;

//writeInterval   100;
writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable no;

libs ( "libfvOptionsCFDEM.so" );

// ************************************************************************* //


